; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l30_p30_c30_g30_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	box11 - box
	box12 - box
	box13 - box
	box14 - box
	box15 - box
	box16 - box
	box17 - box
	box18 - box
	box19 - box
	box20 - box
	box21 - box
	box22 - box
	box23 - box
	box24 - box
	box25 - box
	box26 - box
	box27 - box
	box28 - box
	box29 - box
	box30 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
	human11 - human
	human12 - human
	human13 - human
	human14 - human
	human15 - human
	human16 - human
	human17 - human
	human18 - human
	human19 - human
	human20 - human
	human21 - human
	human22 - human
	human23 - human
	human24 - human
	human25 - human
	human26 - human
	human27 - human
	human28 - human
	human29 - human
	human30 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-at box11 warehouse)
	(box-free box11)
	(box-at box12 warehouse)
	(box-free box12)
	(box-at box13 warehouse)
	(box-free box13)
	(box-at box14 warehouse)
	(box-free box14)
	(box-at box15 warehouse)
	(box-free box15)
	(box-at box16 warehouse)
	(box-free box16)
	(box-at box17 warehouse)
	(box-free box17)
	(box-at box18 warehouse)
	(box-free box18)
	(box-at box19 warehouse)
	(box-free box19)
	(box-at box20 warehouse)
	(box-free box20)
	(box-at box21 warehouse)
	(box-free box21)
	(box-at box22 warehouse)
	(box-free box22)
	(box-at box23 warehouse)
	(box-free box23)
	(box-at box24 warehouse)
	(box-free box24)
	(box-at box25 warehouse)
	(box-free box25)
	(box-at box26 warehouse)
	(box-free box26)
	(box-at box27 warehouse)
	(box-free box27)
	(box-at box28 warehouse)
	(box-free box28)
	(box-at box29 warehouse)
	(box-free box29)
	(box-at box30 warehouse)
	(box-free box30)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 food)
	(box-has box6 food)
	(box-has box7 food)
	(box-has box8 food)
	(box-has box9 food)
	(box-has box10 food)
	(box-has box11 food)
	(box-has box12 food)
	(box-has box13 food)
	(box-has box14 food)
	(box-has box15 food)
	(box-has box16 food)
	(box-has box17 food)
	(box-has box18 food)
	(box-has box19 meds)
	(box-has box20 meds)
	(box-has box21 meds)
	(box-has box22 meds)
	(box-has box23 meds)
	(box-has box24 meds)
	(box-has box25 meds)
	(box-has box26 meds)
	(box-has box27 meds)
	(box-has box28 meds)
	(box-has box29 meds)
	(box-has box30 meds)
	(human-at human1 loc13)
	(human-at human2 loc2)
	(human-at human3 loc5)
	(human-at human4 loc21)
	(human-at human5 loc27)
	(human-at human6 loc6)
	(human-at human7 loc8)
	(human-at human8 loc22)
	(human-at human9 loc18)
	(human-at human10 loc29)
	(human-at human11 loc7)
	(human-at human12 loc4)
	(human-at human13 loc28)
	(human-at human14 loc2)
	(human-at human15 loc10)
	(human-at human16 loc3)
	(human-at human17 loc8)
	(human-at human18 loc29)
	(human-at human19 loc22)
	(human-at human20 loc3)
	(human-at human21 loc29)
	(human-at human22 loc24)
	(human-at human23 loc1)
	(human-at human24 loc29)
	(human-at human25 loc27)
	(human-at human26 loc27)
	(human-at human27 loc20)
	(human-at human28 loc26)
	(human-at human29 loc23)
	(human-at human30 loc18)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 food)
	(human-has human2 food)
	(human-has human3 food)
	(human-has human4 food)
	(human-has human4 meds)
	(human-has human5 food)
	(human-has human5 meds)
	(human-has human6 meds)
	(human-has human8 food)
	(human-has human9 food)
	(human-has human10 food)
	(human-has human12 food)
	(human-has human13 food)
	(human-has human13 meds)
	(human-has human14 food)
	(human-has human14 meds)
	(human-has human18 food)
	(human-has human19 food)
	(human-has human21 meds)
	(human-has human22 food)
	(human-has human22 meds)
	(human-has human24 meds)
	(human-has human25 food)
	(human-has human25 meds)
	(human-has human26 food)
	(human-has human28 food)
	(human-has human28 meds)
	(human-has human29 meds)
	(human-has human30 food)
	(human-has human30 meds)
	))
)

; plan
1. (pick-up drone1 box18 food warehouse)
   deleted: (drone-free drone1) (box-at box18 warehouse)
   added: (drone-carry-box drone1 box18)
   goals met: 1 of 31
2. (move drone1 warehouse loc13)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc13)
   goals met: 0 of 31
3. (drop drone1 box18 food loc13 human1)
   deleted: (drone-carry-box drone1 box18) (box-free box18)
   added: (drone-free drone1) (box-at box18 loc13) (human-has human1 food)
   goals met: 1 of 31
4. (move drone1 loc13 loc5)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 loc5)
   goals met: 1 of 31
5. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 31
6. (pick-up drone1 box17 food warehouse)
   deleted: (drone-free drone1) (box-at box17 warehouse)
   added: (drone-carry-box drone1 box17)
   goals met: 2 of 31
7. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 1 of 31
8. (drop drone1 box17 food loc5 human3)
   deleted: (drone-carry-box drone1 box17) (box-free box17)
   added: (drone-free drone1) (box-at box17 loc5) (human-has human3 food)
   goals met: 2 of 31
9. (move drone1 loc5 loc21)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 loc21)
   goals met: 2 of 31
10. (move drone1 loc21 warehouse)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 31
11. (pick-up drone1 box16 food warehouse)
   deleted: (drone-free drone1) (box-at box16 warehouse)
   added: (drone-carry-box drone1 box16)
   goals met: 3 of 31
12. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 2 of 31
13. (drop drone1 box16 food loc4 human12)
   deleted: (drone-carry-box drone1 box16) (box-free box16)
   added: (drone-free drone1) (box-at box16 loc4) (human-has human12 food)
   goals met: 3 of 31
14. (move drone1 loc4 loc21)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 loc21)
   goals met: 3 of 31
15. (move drone1 loc21 warehouse)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 31
16. (pick-up drone1 box15 food warehouse)
   deleted: (drone-free drone1) (box-at box15 warehouse)
   added: (drone-carry-box drone1 box15)
   goals met: 4 of 31
17. (move drone1 warehouse loc22)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc22)
   goals met: 3 of 31
18. (drop drone1 box15 food loc22 human19)
   deleted: (drone-carry-box drone1 box15) (box-free box15)
   added: (drone-free drone1) (box-at box15 loc22) (human-has human19 food)
   goals met: 4 of 31
19. (move drone1 loc22 warehouse)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 31
20. (pick-up drone1 box14 food warehouse)
   deleted: (drone-free drone1) (box-at box14 warehouse)
   added: (drone-carry-box drone1 box14)
   goals met: 5 of 31
21. (move drone1 warehouse loc22)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc22)
   goals met: 4 of 31
22. (drop drone1 box14 food loc22 human8)
   deleted: (drone-carry-box drone1 box14) (box-free box14)
   added: (drone-free drone1) (box-at box14 loc22) (human-has human8 food)
   goals met: 5 of 31
23. (move drone1 loc22 loc21)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 loc21)
   goals met: 5 of 31
24. (move drone1 loc21 warehouse)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 31
25. (pick-up drone1 box13 food warehouse)
   deleted: (drone-free drone1) (box-at box13 warehouse)
   added: (drone-carry-box drone1 box13)
   goals met: 6 of 31
26. (move drone1 warehouse loc21)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc21)
   goals met: 5 of 31
27. (drop drone1 box13 food loc21 human4)
   deleted: (drone-carry-box drone1 box13) (box-free box13)
   added: (drone-free drone1) (box-at box13 loc21) (human-has human4 food)
   goals met: 6 of 31
28. (move drone1 loc21 warehouse)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 31
29. (pick-up drone1 box12 food warehouse)
   deleted: (drone-free drone1) (box-at box12 warehouse)
   added: (drone-carry-box drone1 box12)
   goals met: 7 of 31
30. (move drone1 warehouse loc28)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc28)
   goals met: 6 of 31
31. (drop drone1 box12 food loc28 human13)
   deleted: (drone-carry-box drone1 box12) (box-free box12)
   added: (drone-free drone1) (box-at box12 loc28) (human-has human13 food)
   goals met: 7 of 31
32. (move drone1 loc28 warehouse)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 31
33. (pick-up drone1 box11 food warehouse)
   deleted: (drone-free drone1) (box-at box11 warehouse)
   added: (drone-carry-box drone1 box11)
   goals met: 8 of 31
34. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 7 of 31
35. (drop drone1 box11 food loc2 human14)
   deleted: (drone-carry-box drone1 box11) (box-free box11)
   added: (drone-free drone1) (box-at box11 loc2) (human-has human14 food)
   goals met: 8 of 31
36. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 31
37. (pick-up drone1 box10 food warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry-box drone1 box10)
   goals met: 9 of 31
38. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 8 of 31
39. (drop drone1 box10 food loc2 human2)
   deleted: (drone-carry-box drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc2) (human-has human2 food)
   goals met: 9 of 31
40. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 31
41. (pick-up drone1 box9 food warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry-box drone1 box9)
   goals met: 10 of 31
42. (move drone1 warehouse loc24)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc24)
   goals met: 9 of 31
43. (drop drone1 box9 food loc24 human22)
   deleted: (drone-carry-box drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc24) (human-has human22 food)
   goals met: 10 of 31
44. (move drone1 loc24 warehouse)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 31
45. (pick-up drone1 box8 food warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry-box drone1 box8)
   goals met: 11 of 31
46. (move drone1 warehouse loc29)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc29)
   goals met: 10 of 31
47. (drop drone1 box8 food loc29 human18)
   deleted: (drone-carry-box drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc29) (human-has human18 food)
   goals met: 11 of 31
48. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 31
49. (pick-up drone1 box7 food warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry-box drone1 box7)
   goals met: 12 of 31
50. (move drone1 warehouse loc29)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc29)
   goals met: 11 of 31
51. (drop drone1 box7 food loc29 human10)
   deleted: (drone-carry-box drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc29) (human-has human10 food)
   goals met: 12 of 31
52. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 31
53. (pick-up drone1 box6 food warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry-box drone1 box6)
   goals met: 13 of 31
54. (move drone1 warehouse loc27)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 12 of 31
55. (drop drone1 box6 food loc27 human26)
   deleted: (drone-carry-box drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc27) (human-has human26 food)
   goals met: 13 of 31
56. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 31
57. (pick-up drone1 box5 food warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 14 of 31
58. (move drone1 warehouse loc27)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 13 of 31
59. (drop drone1 box5 food loc27 human25)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc27) (human-has human25 food)
   goals met: 14 of 31
60. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 31
61. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 15 of 31
62. (move drone1 warehouse loc27)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 14 of 31
63. (drop drone1 box4 food loc27 human5)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc27) (human-has human5 food)
   goals met: 15 of 31
64. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 31
65. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 16 of 31
66. (move drone1 warehouse loc26)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc26)
   goals met: 15 of 31
67. (drop drone1 box3 food loc26 human28)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc26) (human-has human28 food)
   goals met: 16 of 31
68. (move drone1 loc26 warehouse)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 31
69. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 17 of 31
70. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 16 of 31
71. (drop drone1 box2 food loc18 human30)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc18) (human-has human30 food)
   goals met: 17 of 31
72. (move drone1 loc18 warehouse)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 31
73. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 18 of 31
74. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 17 of 31
75. (drop drone1 box1 food loc18 human9)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc18) (human-has human9 food)
   goals met: 18 of 31
76. (move drone1 loc18 warehouse)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 31
77. (pick-up drone1 box30 meds warehouse)
   deleted: (drone-free drone1) (box-at box30 warehouse)
   added: (drone-carry-box drone1 box30)
   goals met: 19 of 31
78. (move drone1 warehouse loc21)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc21)
   goals met: 18 of 31
79. (drop drone1 box30 meds loc21 human4)
   deleted: (drone-carry-box drone1 box30) (box-free box30)
   added: (drone-free drone1) (box-at box30 loc21) (human-has human4 meds)
   goals met: 19 of 31
80. (move drone1 loc21 loc6)
   deleted: (drone-at drone1 loc21)
   added: (drone-at drone1 loc6)
   goals met: 19 of 31
81. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 31
82. (pick-up drone1 box29 meds warehouse)
   deleted: (drone-free drone1) (box-at box29 warehouse)
   added: (drone-carry-box drone1 box29)
   goals met: 20 of 31
83. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 19 of 31
84. (drop drone1 box29 meds loc6 human6)
   deleted: (drone-carry-box drone1 box29) (box-free box29)
   added: (drone-free drone1) (box-at box29 loc6) (human-has human6 meds)
   goals met: 20 of 31
85. (move drone1 loc6 loc28)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc28)
   goals met: 20 of 31
86. (move drone1 loc28 warehouse)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 31
87. (pick-up drone1 box28 meds warehouse)
   deleted: (drone-free drone1) (box-at box28 warehouse)
   added: (drone-carry-box drone1 box28)
   goals met: 21 of 31
88. (move drone1 warehouse loc28)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc28)
   goals met: 20 of 31
89. (drop drone1 box28 meds loc28 human13)
   deleted: (drone-carry-box drone1 box28) (box-free box28)
   added: (drone-free drone1) (box-at box28 loc28) (human-has human13 meds)
   goals met: 21 of 31
90. (move drone1 loc28 loc2)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 loc2)
   goals met: 21 of 31
91. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 31
92. (pick-up drone1 box27 meds warehouse)
   deleted: (drone-free drone1) (box-at box27 warehouse)
   added: (drone-carry-box drone1 box27)
   goals met: 22 of 31
93. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 21 of 31
94. (drop drone1 box27 meds loc2 human14)
   deleted: (drone-carry-box drone1 box27) (box-free box27)
   added: (drone-free drone1) (box-at box27 loc2) (human-has human14 meds)
   goals met: 22 of 31
95. (move drone1 loc2 loc24)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 loc24)
   goals met: 22 of 31
96. (move drone1 loc24 warehouse)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 warehouse)
   goals met: 23 of 31
97. (pick-up drone1 box26 meds warehouse)
   deleted: (drone-free drone1) (box-at box26 warehouse)
   added: (drone-carry-box drone1 box26)
   goals met: 23 of 31
98. (move drone1 warehouse loc24)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc24)
   goals met: 22 of 31
99. (drop drone1 box26 meds loc24 human22)
   deleted: (drone-carry-box drone1 box26) (box-free box26)
   added: (drone-free drone1) (box-at box26 loc24) (human-has human22 meds)
   goals met: 23 of 31
100. (move drone1 loc24 loc29)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 loc29)
   goals met: 23 of 31
101. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 24 of 31
102. (pick-up drone1 box25 meds warehouse)
   deleted: (drone-free drone1) (box-at box25 warehouse)
   added: (drone-carry-box drone1 box25)
   goals met: 24 of 31
103. (move drone1 warehouse loc26)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc26)
   goals met: 23 of 31
104. (drop drone1 box25 meds loc26 human28)
   deleted: (drone-carry-box drone1 box25) (box-free box25)
   added: (drone-free drone1) (box-at box25 loc26) (human-has human28 meds)
   goals met: 24 of 31
105. (move drone1 loc26 loc29)
   deleted: (drone-at drone1 loc26)
   added: (drone-at drone1 loc29)
   goals met: 24 of 31
106. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 25 of 31
107. (pick-up drone1 box24 meds warehouse)
   deleted: (drone-free drone1) (box-at box24 warehouse)
   added: (drone-carry-box drone1 box24)
   goals met: 25 of 31
108. (move drone1 warehouse loc23)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc23)
   goals met: 24 of 31
109. (drop drone1 box24 meds loc23 human29)
   deleted: (drone-carry-box drone1 box24) (box-free box24)
   added: (drone-free drone1) (box-at box24 loc23) (human-has human29 meds)
   goals met: 25 of 31
110. (move drone1 loc23 loc29)
   deleted: (drone-at drone1 loc23)
   added: (drone-at drone1 loc29)
   goals met: 25 of 31
111. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 26 of 31
112. (pick-up drone1 box23 meds warehouse)
   deleted: (drone-free drone1) (box-at box23 warehouse)
   added: (drone-carry-box drone1 box23)
   goals met: 26 of 31
113. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 25 of 31
114. (drop drone1 box23 meds loc18 human30)
   deleted: (drone-carry-box drone1 box23) (box-free box23)
   added: (drone-free drone1) (box-at box23 loc18) (human-has human30 meds)
   goals met: 26 of 31
115. (move drone1 loc18 loc29)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 loc29)
   goals met: 26 of 31
116. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 27 of 31
117. (pick-up drone1 box22 meds warehouse)
   deleted: (drone-free drone1) (box-at box22 warehouse)
   added: (drone-carry-box drone1 box22)
   goals met: 27 of 31
118. (move drone1 warehouse loc29)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc29)
   goals met: 26 of 31
119. (drop drone1 box22 meds loc29 human21)
   deleted: (drone-carry-box drone1 box22) (box-free box22)
   added: (drone-free drone1) (box-at box22 loc29) (human-has human21 meds)
   goals met: 27 of 31
120. (move drone1 loc29 warehouse)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 warehouse)
   goals met: 28 of 31
121. (pick-up drone1 box21 meds warehouse)
   deleted: (drone-free drone1) (box-at box21 warehouse)
   added: (drone-carry-box drone1 box21)
   goals met: 28 of 31
122. (move drone1 warehouse loc29)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc29)
   goals met: 27 of 31
123. (drop drone1 box21 meds loc29 human24)
   deleted: (drone-carry-box drone1 box21) (box-free box21)
   added: (drone-free drone1) (box-at box21 loc29) (human-has human24 meds)
   goals met: 28 of 31
124. (move drone1 loc29 loc27)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 loc27)
   goals met: 28 of 31
125. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 29 of 31
126. (pick-up drone1 box20 meds warehouse)
   deleted: (drone-free drone1) (box-at box20 warehouse)
   added: (drone-carry-box drone1 box20)
   goals met: 29 of 31
127. (move drone1 warehouse loc27)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 28 of 31
128. (drop drone1 box20 meds loc27 human5)
   deleted: (drone-carry-box drone1 box20) (box-free box20)
   added: (drone-free drone1) (box-at box20 loc27) (human-has human5 meds)
   goals met: 29 of 31
129. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 30 of 31
130. (pick-up drone1 box19 meds warehouse)
   deleted: (drone-free drone1) (box-at box19 warehouse)
   added: (drone-carry-box drone1 box19)
   goals met: 30 of 31
131. (move drone1 warehouse loc27)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc27)
   goals met: 29 of 31
132. (drop drone1 box19 meds loc27 human25)
   deleted: (drone-carry-box drone1 box19) (box-free box19)
   added: (drone-free drone1) (box-at box19 loc27) (human-has human25 meds)
   goals met: 30 of 31
133. (move drone1 loc27 warehouse)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 warehouse)
   goals met: 31 of 31
